Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 06-Red-Riding-Hood/CAT/red-riding-hood-seven-kids/tm/corpus-nt-bbe.en.utf8.tmx
Source language: en
Languages: chr

source: That all living things will be made free from the power of death and will have a part with the free children of God in glory.
chr: ᎾᏍᎩ ᎠᎦᏁᎳᏅᎯ ᎤᏩᏒ ᎾᏍᏉ ᎤᏚᏓᎴᏍᏗᏱ ᎠᏲᎩ ᎨᏒ ᎤᎾᏝᎥᎢ, ᎦᎸᏉᏗᏳ ᏂᏗᎨᏥᎾᏝᎥᎾ ᎨᏒ ᎤᏁᎳᏅᎯ ᏧᏪᏥ ᎤᎾᏤᎵᎦ ᏫᏗᎨᏥᎪᏗᏱ.

source: For we are conscious that all living things are weeping and sorrowing in pain together till now.
chr: ᎢᏗᎦᏔᎭᏰᏃ ᎾᏍᎩ ᎾᏂᎥ ᎨᎦᏁᎳᏅᎯ ᎨᏒ ᎢᏧᎳᎭ ᎤᏂᎵᏰᏗᏍᎬ ᎠᎴ ᎠᏂᎩᎵᏲᎬ ᎪᎯ ᎢᏯᏍᏗ.

source: And not only so, but we who have the first fruits of the Spirit, even we have sorrow in our minds, waiting for the time when we will take our place as sons, that is, the salvation of our bodies.
chr: ᎥᏝ ᎠᎴ ᎤᏅᏒᏉ, ᎢᎬᏒᏍᎩᏂ ᎾᏍᏉ ᎾᏍᎩ ᎢᎬᏱᏱ ᎤᎾᏄᎪᏫᏒᎯ ‾ᎠᏓᏅᏙ ᏥᎨᎭ, ᎠᏴ ᎾᏍᏉ ᎢᎬᏒ ᎨᏒ ᎭᏫᏂ ᏕᎩᎵᏰᏗᎭ, ᎢᏗᎦᏘᏴ ᏧᏪᏥ ᎢᎨᎬᏁᏗ, ᎾᏍᎩ ᏗᏗᏰᎸ ᏧᎫᏴᏗᏱ ᏧᏭᏓᎴᏍᏗᏱ.

source: For our salvation is by hope: but hope which is seen is not hope: for who is hoping for what he sees?
chr: ᎤᏚᎩᏉᏰᏃ ᎢᎬᎭ ᎡᎩᏍᏕᎸᏗᏱ; ᎤᏚᎩᏍᎩᏂ ᎣᏩᏒ ᎠᎪᎲᎯ ᏥᎨᏐᎢ ᎥᏝ ᎤᏚᎩ ᏲᏩᏐᎢ; ᎪᎱᏍᏗᏰᏃ ᏨᎪᏩᏘᏍᎪᎢ, ᎦᏙᏃ ᎠᏏ ᎤᏚᎩ ᏱᎦᏲᏩᎭ?

source: But if we have hope for that which we see not, then we will be able to go on waiting for it.
chr: ᎢᏳᏍᎩᏂ ᎢᎩᎪᎲᎯ ᏂᎨᏒᎾ ᎨᏒ ᎤᏚᎩ ᏱᎬᎭ, ᎿᏉ ᏗᏛᏂᏗᏳ ᎢᏗᎦᏘᏲ ᎾᏍᎩ.

source: And in the same way the Spirit is a help to our feeble hearts: for we are not able to make prayer to God in the right way; but the Spirit puts our desires into words which are not in our power to say;
chr: ᎾᏍᎩᏯ ᎾᏍᏉ ᎠᏓᏅᏙ ᎢᎩᏍᏕᎵᎭ ᏗᏗᏩᎾᎦᎳᎯᏳ ᎨᏒᎢ; ᎥᏝᏰᏃ ᏱᏗᎦᏔᎭ ᎢᏳᏍᏗ ᏚᏳᎪᏛ ᎨᏒ ᎢᎩᏔᏲᏍᏗᏱ ᎢᏓᏓᏙᎵᏍᏗᏍᎬᎢ; ᎠᏓᏅᏙᏍᎩᏂ ᎤᏩᏒ ᎢᎦᎵᏍᏗᏰᏓᏁᎭ ᎤᎵᏰᏗᏍᎬ ᎬᏗᎭ ᎾᏍᎩ ᎦᏁᎢᏍᏗ ᏂᎨᏒᎾ ᎨᏒᎢ.

source: And he who is the searcher of hearts has knowledge of the mind of the Spirit, because he is making prayers for the saints in agreement with the mind of God.
chr: ᎠᎴ ᎾᏍᎩ Ꮎ ᏗᎪᎵᏰᏍᏗ ᏧᎾᏫ ᎠᎦᏔᎭ ᏄᏍᏛ ᎠᏓᏅᏖᎵᏙᎲ ᎠᏓᏅᏙ ᏅᏗᎦᎵᏍᏙᏗ ᎤᎾᏓᏅᏘ ᏓᎵᏍᏗᏰᏓᏁᎲ ᎾᏍᎩᏯ ᎤᏁᎳᏅᎯ ᎣᏏᏳ ᎤᏰᎸᏗ ᎨᏒᎢ.

source: And we are conscious that all things are working together for good to those who have love for God, and have been marked out by his purpose.
chr: ᎠᎴ ᎢᏗᎦᏔᎭ ᎾᏍᎩ ᏂᎦᎥ ᏂᏚᎵᏍᏔᏂᏙᎲ ᎤᎾᏖᏆᎶᏒ ᎣᏍᏛ ᎢᏳᎾᎵᏍᏓᏁᏗᏱ ᏚᏂᎸᏫᏍᏓᏁᎲ ᎤᏁᎳᏅᎯ ᎤᏂᎨᏳᎯ, ᎾᏍᎩ Ꮎ ᎨᏥᏯᏅᏛ ᏥᎩ ᎾᏍᎩᏯ ᎤᏓᏅᏖᎸᎢ.

source: Because those of whom he had knowledge before they came into existence, were marked out by him to be made like his Son, so that he might be the first among a band of brothers:
chr: ᎾᏍᎩᏰᏃ ᎦᏳᎳ ᏥᏂᏓᎦᏔᎰᎢ, ᎾᏍᎩ ᎾᏍᏉ ᏂᏚᏑᏰᏐ ᎤᏪᏥ ᏄᏍᏛ ᎾᏍᎩᏯ ᎢᏳᎾᎵᏍᏙᏗᏱ, ᎾᏍᎩ ᎢᎬᏱ ᎡᎯ ᎢᏳᎵᏍᏙᏗᏱ ᎤᏂᏣᏘ ᎠᎾᎵᏅᏟ ᎠᏁᎲᎢ.

source: And those who were marked out by him were named; and those who were named were given righteousness; and to those to whom he gave righteousness, in the same way he gave glory.
chr: ᎾᏍᎩᏃ ᎦᏳᎳ ᏥᏂᏚᏑᏰᏐᎢ ᎾᏍᎩ ᎾᏍᏉ ᏚᏯᏅᎮᎢ; ᎠᎴ ᎾᏍᎩ ᏧᏯᏅᏛ ᎨᏒᎢ, ᎾᏍᎩ ᎾᏍᏉ ᏚᏭᏓᎴᏎᎢ; ᎠᎴ ᎾᏍᎩ ᏧᏭᏓᎴᏛ ᎨᏒ, ᎾᏍᎩ ᎾᏍᏉ ᎦᎸᏉᏗᏳ ᏂᏚᏩᏁᎴᎢ.

source: What may we say about these things? If God is for us, who is against us?
chr: ᎦᏙᏃ ᏓᏓᏛᏂ ᎯᎠ ᎾᏍᎩ ᏥᏄᏍᏗ? ᎢᏳᏃ ᎤᏁᎳᏅᎯ ᏱᎩᏍᏕᎵᎭ ᎦᎪ ᏱᎦᏡᏓ?

source: He who did not keep back his only Son, but gave him up for us all, will he not with him freely give us all things?
chr: ᎾᏍᎩ Ꮎ ᏄᎨᏳᏅᎾ ᏥᎨᏎ ᎤᏩᏒ ᎤᏪᏥ, ᏥᏚᏲᏎᏉᏍᎩᏂ ᎠᏴ ᏂᏗᎥ ᎢᎩᏍᏕᎵᏍᎬᎢ, ᎦᏙ ᏱᎦᎵᏍᏙᏓ ᎾᏍᎩ ᏕᎩᏲᎯᏎᎲ ᎠᏎᏉ ᏗᎨᎩᏲᎯᏎᏗ ᏂᎨᏒᎾ ᏱᏂᎦᎵᏍᏓ ᏂᎦᏗᏳ ᎪᎱᏍᏗ?

source: Who will say anything against the saints of God? It is God who makes us clear from evil;
chr: ᎦᎪ ᎤᏂᏍᎦᏅᏨ ᏙᏓᎫᎯᏍᏔᏂ ᎤᎾᎴᏅᎯ ᏧᏑᏰᏛ? ᏥᎪ ᎤᏁᎳᏅᎯ, ᎾᏍᎩ ᎤᏄᏓᎴᏍᎩ?

source: Who will give a decision against us? It is Christ Jesus who not only was put to death, but came again from the dead, who is now at the right hand of God, taking our part.
chr: ᎦᎪ ᏧᏄᎪᏓᏁᎯ? ᎦᎶᏁᏛᏍᎪ, ᎾᏍᎩ ᏧᏂᎱᏎᎢ, ᎥᎥ, ᎠᎴ ᎾᏍᏉ ᎾᏍᎩ ᏥᏚᎴᎯᏌᏅ, ᎾᏍᎩ ᎾᏍᏉ ᎤᏁᎳᏅᎯ ᎠᎦᏗᏏᏗᏢ ᏧᏬᎳ, ᎾᏍᎩ ᎾᏍᏉ ᏥᎦᎵᏍᏗᏰᏓᏁᎭ?

source: Who will come between us and the love of Christ? Will trouble, or pain, or cruel acts, or the need of food or of clothing, or danger, or the sword?
chr: ᎦᎪ ᎢᏴᏛ ᏅᏓᎬᏁᎵ ᎦᎶᏁᏛ ᎢᎩᎨᏒᎢ? ᏥᎪ ᎠᎩᎵᏲᎢᏍᏗ ᎨᏒᎢ, ᎠᎴ ᎤᏪᎵᎯᏍᏗ ᎠᏓᏅᏓᏗᏍᏗ ᎨᏒᎢ, ᎠᎴ ᎤᏲ ᎢᏴᏓᏛᏁᏗ ᎨᏒᎢ, ᎠᎴ ᎤᏓᎪᏄᎶᎯᏍᏗ ᎨᏒᎢ, ᎠᎴ ᏗᎩᏰᎸᎭ ᎨᏒᎢ, ᎠᎴ ᎤᎾᏰᎯᏍᏗ ᎨᏒᎢ, ᎠᎴ ᎠᏰᎳᏍᏗ-ᎦᏅᎯᏛ?

source: As it is said in the holy Writings, Because of you we are put to death every day; we are like sheep ready for destruction.
chr: ᎾᏍᎩᏯ ᎯᎠ ᏥᏂᎬᏅ ᏥᎪᏪᎳ, ᏂᎯ ᎨᏒ ᏅᏗᎦᎵᏍᏙᏗᎭ ᏙᎩᎢᎭ ᏂᎪᎯᎸᎢ; ᎤᏂᏃᏕᎾᏉ ᏗᎯᏍᏗ ᎾᏍᎩᏯ ᎣᎩᏰᎸᎠ;

source: But we are able to overcome all these things and more through his love.
chr: ᎠᏎᏃ ᎯᎠ ᎾᏍᎩ ᏂᎦᏛ ᏧᏓᎴᏅᏛ ᎨᏒ ᎢᏓᏓᏎᎪᎩᏍᎩ ᎠᎴ ᎤᏟ ᎢᎦᎢ, ᎾᏍᎩ Ꮎ ᎢᎩᎨᏳᎯᏳ ᎢᏳᎵᏍᏔᏅᎯ ᏥᎩ ᎢᏳᏩᏂᏌᏛ.

source: For I am certain that not death, or life, or angels, or rulers, or things present, or things to come, or powers,
chr: ᎤᎵᏂᎩᏛᏰᏃ ᎠᏉᎯᏳᎭ, ᎾᏍᎩ ᎥᏝ ᎠᏲᎱᎯᏍᏗ ᎨᏒᎢ, ᎠᎴ ᎠᏛᏂᏗᏍᏗ ᎨᏒᎢ, ᎠᎴ ᏗᏂᎧᎿᏩᏗᏙᎯ, ᎠᎴ ᏄᏂᎬᏫᏳᏌᏕᎩ, ᎠᎴ ᎨᏥᎸᏉᏗ, ᎠᎴ ᎪᎱᏍᏗ ᎪᎯ ᏤᎭ, ᎠᎴ ᎪᎱᏍᏗ ᎠᏏ ᎤᎾᏄᎪᎢᏍᏗ ᏥᎩ,

source: Or things on high, or things under the earth, or anything which is made, will be able to come between us and the love of God which is in Christ Jesus our Lord.
chr: ᎥᏝ ᎠᎴ ᎦᎸᎳᏗᏳ ᎨᏒᎢ, ᎠᎴ ᎭᏫᏂᏳ ᎨᏒᎢ, ᎥᏝ ᎠᎴ ᏅᏩᏓᎴ ᎠᏁᎳᏅᎯ ᎨᏒᎢ, ᏰᎵ ᎢᏴᏛ ᎢᎬᏩᏁᏗ ᏱᎨᏎᏍᏗ ᎤᏁᎳᏅᎯ ᎢᎩᎨᏳᏒᎢ, ᎾᏍᎩ ᎦᎶᏁᏛ ᏥᏌ ᎤᎬᏫᏳᎯ ᎢᎦᏤᎵ ᏅᏓᏳᏓᎴᏅᎯ ᏥᎩ.

source: I say what is true in Christ, and not what is false, my mind giving witness with me in the Holy Spirit,
chr: ᎤᏙᎯᏳᎯᏯ ᏥᏁᎦ ᎦᎶᏁᏛ ᎠᎦᏔᎲᎢ, ᎥᏝ ᏱᎦᏥᎪᎥᏍᎦ, ᎠᏆᏓᏅᏛ ᎾᏍᏉ ᎠᏉᎯᏳᏓᏁᎯ ᏂᎦᎵᏍᏗᎭ ᎦᎸᏉᏗᏳ ᎠᏓᏅᏙ ᎢᏳᏩᏂᏌᏛ,

source: That I am full of sorrow and pain without end.
chr: ᎾᏍᎩ ᎤᏣᏘ ᎡᎯᏍᏗ ᎠᏆᏓᏅᏔᏩᏕᎬ ᎠᎴ ᏂᎪᎯᎸ ᎤᏲ ᎠᎩᏰᎸᏒ ᎠᎩᎾᏫᏱ.

source: For I have a desire to take on myself the curse for my brothers, my family in the flesh:
chr: ᎬᏆᏚᎸᏗᏉᏰᏃ ᎠᏋᏒ ᎨᏒ ᎥᎩᏍᎦᏨᎯ ᎢᏳᎵᏍᏙᏗᏱ ᎥᏆᏓᏓᎴᏙᏗᏱ ᎦᎶᏁᏛ ᎡᎲᎢ ᎦᏥᏍᏕᎵᏍᎬ ᎣᏣᏓᏅᏟ, ᎪᎱᏍᏗ ᏗᏋᏅ Ꭰ ᎤᏇᏓᎵ ᎨᏒᎢ;

source: Who are Israelites: who have the place of sons, and the glory, and the agreements with God, and the giving of the law, and the worship, and the hope offered by God:
chr: ᎾᏍᎩ ᎢᏏᎵ ᏧᏁᏢᏔᏅᏛ ᏥᎩ; ᎾᏍᎩ ᎤᎾᏤᎵᎦ ᏥᎩ [ᎤᏁᎳᏅᎯ] ᏧᏪᏥ ᎢᎨᎬᏁᏗ ᎨᏒᎢ, ᎠᎴ ᎦᎸᏉᏗᏳ ᎨᏒᎢ, ᎠᎴ ᎧᏃᎮᏛ ᏓᏠᎯᏍᏛᎢ, ᎠᎴ ᏗᎧᎿᏩᏛᏍᏗ ᎨᏥᏁᏗ ᎨᏒᎢ, ᎠᎴ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᏗᎦᎸᏫᏍᏓᏁᏗ ᎨᏒᎢ, ᎠᎴ ᎠᏚᎢᏍᏙᏗ ᎨᏒᎢ;

source: Whose are the fathers, and of whom came Christ in the flesh, who is over all, God, to whom be blessing for ever. So be it.
chr: ᎾᏍᎩ ᏧᏂᏙᏓ ᏥᎩ ᎠᏂᎦᏴᎵᎨᎢ, ᎠᎴ ᎾᏍᎩ ᎠᏁᎲᎢ, Ꭰ ᎠᏇᏓᎵ ᎨᏒ ᏧᎷᏤ ᎦᎶᏁᏛ, ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᏥᎩ, ᏄᏓᎴᏒ ᎤᎬᏫᏳᏌᏕᎩ, ᏫᎾᏍᏛᎾ ᎦᎸᏉᏙᏗ. ᎡᎹᏅ.

source: But it is not as if the word of God was without effect. For they are not all Israel, who are of Israel:
chr: ᎥᏝ ᎠᏗᎾ ᎤᏁᎳᏅᎯ ᎤᏁᏨ ᎠᏎᏉᏉ ᏥᏄᎵᏍᏔᏃ ᎾᏍᎩᏯ [ᏱᏥᏁᎦ,] ᎥᏝᏰᏃ ᏂᎦᏛ ᎢᏏᎵ ᏱᎩ ᎾᏍᎩ ᎢᏏᎵ ᏧᏁᏢᏔᏅᏛ ᏥᎩ.

source: And they are not all children because they are the seed of Abraham; but, In Isaac will your seed be named.
chr: ᎥᏝ ᎠᎴ ᎡᏆᎭᎻ ᏧᏁᏢᏔᏅᏛ ᏥᎩ ᎾᏍᎩ ᏱᏅᏗᎦᎵᏍᏙᏗᎭ ᏂᎦᏛ ᏧᏪᏥ ᏱᎩ; ᎡᏏᎩᏉᏍᎩᏂ ᏚᏙᎥ ᎨᏥᏯᏅᏗᏍᎨᏍᏗ ᏣᏁᏢᏔᏅᎯ.

source: That is, it is not the children of the flesh, but the children of God's undertaking, who are named as the seed.
chr: ᎾᏍᎩ ᏯᏛᏅ, ᎤᏇᏓᎵ ᎨᏒ ᎤᎾᏕᏔᏅᎯ ᎨᏒᎢ, ᎾᏍᎩ ᎯᎠ ᎥᏝ ᎤᏁᎳᏅᎯ ᏧᏪᏥ ᏱᎩ; ᎠᏚᎢᏍᏛᏍᎩᏂ ᎤᎾᏕᏔᏅᎯ ᎨᏒ ᎾᏍᎩ ᏧᏪᏥ ᏧᏰᎸᏗ.

source: For this is the word of God's undertaking, At this time will I come, and Sarah will have a son.
chr: ᎯᎠᏰᏃ ᏄᏍᏗ ᎤᎵᏁᏨ ᎠᏚᎢᏍᏛᎢ. ᎯᎠᏉ ᎢᏳ ᏓᏥᎷᏥ, ᎠᎴ ᏎᎵ ᏓᎦᎾᏄᎪᏫᏏ ᎠᏧᏣ.

source: And not only so, but Rebecca being about to have a child by our father Isaac--
chr: ᎥᏝ ᎠᎴ ᎾᏍᎩᏉ ᏱᏄᏍᏗ; ᎵᏇᎩᏍᎩᏂ ᎾᏍᏉ ᎤᏁᎵᏨ, ᎾᏍᎩ ᎠᏏᏴᏫ ᎠᏥᏁᎵᏤᎸ, ᎾᏍᎩ ᎢᎩᏙᏓ ᎡᏏᎩ;

source: Before the children had come into existence, or had done anything good or bad, in order that God's purpose and his selection might be effected, not by works, but by him whose purpose it is,
chr: ᏗᏂᏲᎵᏰᏃ ᎠᏏ ᎾᎾᏕᎲᏍᎬᎾ ᎨᏎᎢ, ᎠᎴ ᎠᏏ ᎪᎱᏍᏗ ᎣᏍᏛ ᎠᎴ ᎤᏲᎢ ᎾᎾᏛᏁᎲᎾ ᎨᏎᎢ, ᎾᏍᎩ ᎤᏓᏅᏖᎸ ᎤᏁᎳᏅᎯ ᎾᏍᎩᏯ ᏧᏑᏰᏍᏗ ᎨᏒ ᎤᏲᎢᏍᏗ ᏂᎨᏒᎾ ᎢᏳᎵᏍᏙᏗᏱ, ᎥᏝ ᏚᏂᎸᏫᏍᏓᏁᎲ ᏅᏗᎦᎵᏍᏙᏗᏍᎬᎢ, ᎾᏍᎩᏯᏍᎩᏂ ᏗᏯᏂᏍᎩ ᎤᏓᏅᏖᎸᎢ;

source: It was said to her, The older will be the servant of the younger.
chr: ᎯᎠ ᎾᏥᏪᏎᎴᎢ, ᎤᏓᏂᎵᎨ ᏚᏁᎶᏕᏍᏗ ᎣᏂ ᎡᎯ;

source: Even as it is said, I had love for Jacob, but for Esau I had hate.
chr: ᎾᏍᎩᏯ ᎯᎠ ᏥᏂᎬᏅ ᏥᎪᏪᎳ, ᏤᎦᏈ ᎣᏏᏳ ᏥᏰᎸᏅ, ᎢᏐᏍᎩᏂ ᏥᏂᏆᏘᎸ.

source: What may we say then? is God not upright? let it not be said.
chr: ᎾᏍᎩᏃ ᏥᏄᏍᏗ ᎦᏙ ᏓᏓᏛᏂ? ᏥᎪ ᏂᏚᏳᎪᏛᎾ ᎨᏒ ᎤᏪᎭ ᎤᏁᎳᏅᎯ? ᎬᏩᏟᏍᏗ.

source: For he says to Moses, I will have mercy on whom I will have mercy, and pity on whom I will have pity.
chr: ᎣᏏᏰᏃ ᎯᎠ ᎾᏥᏪᏎᎭ, ᏥᏯᏙᎵᏍᏗ ᎨᏎᏍᏗ ᎾᏍᎩ Ꮎ ᏥᏯᏙᎵᎩ ᎨᎵᏍᎨᏍᏗ, ᎠᎴ ᎤᏪᏙᎵᏍᏗ ᏥᏯᏓᏅᏓᏗᏍᏗ ᎨᏎᏍᏗ ᎾᏍᎩ Ꮎ ᎤᏪᏙᎵᏍᏗ ᏥᏯᏓᏅᏓᏓ ᎨᎵᏍᎨᏍᏗ.

source: So then, it is not by the desire or by the attempt of man, but by the mercy of God.
chr: ᎾᏍᎩᏃ ᏥᏄᏍᏗ ᎥᏝ ᎩᎶ ᎤᏚᎸᎲ ᏱᏅᏗᎦᎵᏍᏙᏗᎭ, ᎥᏝ ᎠᎴ ᏚᏍᏆᎸᏔᏅ ᏱᏅᏗᎦᎵᏍᏙᏗᎭ, ᎤᎾᎳᏅᎯᏍᎩᏂ ᎤᏓᏅᏖᎸᎢ ᎾᏍᎩ ᏗᎦᏙᎵᎩ ᏥᎩ.

source: For the holy Writings say to Pharaoh, For this same purpose did I put you on high, so that I might make my power seen in you, and that there might be knowledge of my name through all the earth.
chr: ᎪᏪᎵᎯᏰᏃ ᎯᎠ ᎾᏥᏪᏎ ᏇᏓᏲ, ᎾᏍᎩ ᎯᎠ ᏅᏗᎦᎵᏍᏙᏗᎭ ᏕᎬᏯᎴᏔᏅ, ᎾᏍᎩ ᎠᎩᎾᏄᎪᏫᏍᏗᏱ ᎠᏆᎵᏂᎩᏗᏳ ᎨᏒ ᏂᎯ ᎬᏴᏗᏍᎬᎢ, ᎠᎴ ᎾᏍᎩ ᎠᏴ ᏓᏆᏙᎥ ᏧᏃᏣᎶᎢᏍᏗᏱ ᎡᎶᎯ ᏂᎬᎾᏛᎢ.

source: So then, at his pleasure he has mercy on a man, and at his pleasure he makes the heart hard.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎦᏙᎵᎪ ᎾᏍᎩ Ꮎ ᏥᏯᏙᎵᎩ ᎡᎳ, ᎠᎴ ᎩᎶ ᏥᏍᏓᏱᏓ ᎡᎳ ᎠᏍᏓᏱᏗᏍᎪᎢ.

source: But you will say to me, Why does he still make us responsible? who is able to go against his purpose?
chr: ᎯᎠ Ꭷ ᎨᎵ ᏅᏛᏍᎩᏪᏎᎵ, ᎦᏙᏃ ᎠᏏᏉ ᎡᏍᎦ ᎠᏰᎸᏍᎦ? ᎦᎪᏰᏃ ᏚᎦᏘᎴᏅ ᏄᏍᏛ ᎠᏓᏅᏖᏍᎬᎢ?

source: But, O man, who are you, to make answer against God? May the thing which is made say to him who made it, Why did you make me so?
chr: ᎠᏎᏃ ᏂᎯ ᏴᏫᏉ ᎦᎪ ᎢᏣᏍᏗ ᏥᏁᏤᎭ ᏕᎯᎦᏘᎴᎬ ᎤᏁᎳᏅᎯ? ᏥᎪ ᎪᎱᏍᏗ ᎠᏢᏅᎯ ᎯᎠ ᏅᏓᎦᏪᏎᎵ ᎾᏍᎩ ᎤᏬᏢᏅᎯ, ᎦᏙᏃ ᎾᏍᎩ ᎯᎠ ᏂᏍᏋᏁᎸ ᎢᏍᏉᏢᏅ?

source: Or has not the potter the right to make out of one part of his earth a vessel for honour, and out of another a vessel for shame?
chr: ᏝᏍᎪ ᏗᏩᎵ ᏗᎪᏢᏍᎩ ᏳᎭ ᎠᏓᏅᏖᏍᎬ ᎢᏳᏩᏁᎵᏓᏍᏗᏱ ᎦᏓᏆᎳ, ᎾᏍᎩᏉ ᎦᎾᏆᎸᏒ ᎠᎬᎭᎸᏛ ᏌᏉ ᎠᏖᎵᏙ ᎤᏬᏢᏗᏱ ᎦᎸᏉᏙᏗ, ᏅᏩᏓᎴᏃ ᎦᎸᏉᏙᏗ ᏂᎨᏒᎾ?

source: What if God, desiring to let his wrath and his power be seen, for a long time put up with the vessels of wrath which were ready for destruction:
chr: [ᎦᏙᏃ ᏳᏍᏗ,] ᎢᏳᏃ ᎤᏁᎳᏅᎯ ᎤᏚᎵᏍᎬ ᎬᏂᎨᏒ ᎢᏳᏩᏁᏗᏱ ᎤᏔᎳᏬᎯᏍᏗ ᎨᏒᎢ, ᎠᎴ ᎤᎵᏂᎬᎬ ᎤᎾᏄᎪᏫᏍᏗᏱ, ᎬᏂᏗᏳ ᎨᏒ ᎬᏗᏍᎬ ᎪᎯᏗᏳ ᎤᏁᎳᎩ ᏱᏚᏪᎵᏎᎸ ᏗᏖᎵᏙ ᎤᏔᎳᏬᎯᏍᏗ ᎨᏒ ᏗᏟᏍᏗ, ᏗᏛᏅᎢᏍᏔᏅᎯ ᏗᏛᏙᏗᏱ;

source: And to make clear the wealth of his glory to vessels of mercy, which he had before made ready for glory,
chr: ᎠᎴ ᎾᏍᎩ [ᎤᏚᎵᏍᎬ] ᎬᏂᎨᏒ ᎢᏳᏩᏁᏗᏱ ᎤᏤᎵ ᎤᏣᏔᏅᎯ ᎦᎸᏉᏗᏳ ᎨᏒ ᏕᎬᏗᏍᎬ ᏗᏖᎵᏙ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᏗᏟᏍᏗ, ᎾᏍᎩ ᏧᏛᏅᎢᏍᏔᏅᎯ ᏥᏂᎨᏎ ᎦᎸᏉᏗᏳ ᏗᎨᏒ ᏭᎾᏕᏗᏱ,

source: Even us, who were marked out by him, not only from the Jews, but from the Gentiles?
chr: ᎾᏍᎩ ᎠᏴ, ᎢᎩᏯᏅᏛ ᏥᎩ, ᎥᏝ ᎠᏂᏧᏏᏉ ᎤᏅᏒ ᎠᏁᎲᎢ, ᎾᏍᏉᏍᎩᏂ ᏧᎾᏓᎴᏅᏛ ᏴᏫ ᎠᏁᎲᎢ;

source: As he says in Hosea, They will be named my people who were not my people, and she will be loved who was not loved.
chr: ᎾᏍᎩᏯ ᎾᏍᏉ ᎯᎠ ᏥᏂᎦᏪ ᎰᏏᎠ ᎤᏬᏪᎸᎢ; ᏗᏆᏤᎵ ᏴᏫ ᎦᏥᏲᏎᎮᏍᏗ ᎾᏍᎩ Ꮎ ᏗᏆᏤᎵ ᏴᏫ ᏂᎨᏒᎾ ᏥᎨᏒᎩ; ᎠᎴ ᏥᎨᏳᎢ (ᏥᏲᏎᎮᏍᏗ,) ᎾᏍᎩ Ꮎ ᏥᎨᏳᎢ ᏂᎨᏒᎾ ᏥᎨᏒᎩ.

source: And in the place where it was said to them, You are not my people, there they will be named the sons of the living God.
chr: ᎠᎴ ᎯᎠ ᏅᏓᎦᎵᏍᏔᏂ, ᎾᎿᏂ ᎯᎠ ᏂᎨᏥᏪᏎᎸᎢ, ᏂᎯ ᎥᏝ ᎠᏴ ᏗᏆᏤᎵ ᏴᏫ ᏱᎩ; ᎾᎿᏂ ᎬᏂᏛ ᎤᏁᎳᏅᎯ ᏧᏪᏥ ᎨᎪᏎᎮᏍᏗ.

source: And Isaiah says about Israel, Even if the number of the children of Israel is as the sand of the sea, only a small part will get salvation:
chr: ᎢᏌᏯ ᎾᏍᏉ ᎯᎠ ᏂᎦᏪᎭ ᎢᏏᎵ ᏕᎧᏁᎢᏍᏗᏍᎬᎢ; ᎢᏏᎵ ᏧᏪᏥ ᎾᏍᏉ ᏃᏳ ᎠᎺᏉᎯ ᎦᎳᎨᏴ ᎾᏍᎩᏯ ᏱᏄᎾᏧᏈᏍᏗ, ᎤᎾᎵᏃᎯᏴᎯ ᎠᏎ ᎨᏥᏍᏕᎸᏗ ᎨᏎᏍᏗ.

source: For the Lord will give effect to his word on the earth, putting an end to it and cutting it short.
chr: ᏛᏍᏆᏗᏰᏃ ᏗᎦᎸᏫᏍᏓᏁᏗ ᎨᏒᎢ, ᎠᎴ ᏚᏳᎪᏛ ᎬᏗ ᎤᎵᏍᏗᏳ ᎾᏍᎩ ᏅᏛᏛᏁᎵ; ᎤᎵᏍᏗᏰᏃ ᏅᏛᏛᏁᎵ ᏄᏍᏛ ᏚᏭᎪᏔᏅ ᎡᎶᎯ.

source: And, as Isaiah had said before, If the Lord of armies had not given us a seed, we would have been like Sodom and Gomorrah.
chr: ᎠᎴ ᎾᏍᎩᏯ ᎢᏌᏯ ᎦᏳᎳ ᎯᎠ ᏥᏄᏪᏐᎢ, ᎢᏳᏃ ᏱᎰᏩ ᎤᏂᏣᏘ ᏧᏓᏘᎾᎢ ᏂᎩᏃᎯᏰᎸᎾ ᏱᎨᏎ ᎤᎵᏃᎯᏴᎯ, ᏐᏓᎻᏉ ᏱᏗᏓᏤᎴᎢ, ᎠᎴ ᎪᎹᎵ ᏄᏍᏛ ᎾᏍᎩᏯ ᏱᏂᎦᏍᏕᎢ.

source: What then may we say? That the nations who did not go after righteousness have got righteousness, even the righteousness which is of faith:
chr: ᎾᏍᎩᏃ ᏥᏄᏍᏗ ᎦᏙ ᏓᏓᏛᏂ? ᎾᏍᎩ Ꮎ ᏧᎾᏓᎴᏅᏛ ᏴᏫ, ᎾᏍᎩ ᎠᏚᏓᎴᏍᏗ ᎨᏒ ᏄᏂᏍᏓᏩᏛᏒᎾ ᎨᏒ, ᎾᏍᎩ ᎠᏚᏓᎴᏍᏗ ᎨᏒ ᎤᏂᏩᏛᎲ, ᎾᏍᎩ ᎪᎯᏳᏗ ᎨᏒ ᎠᏚᏓᎴᏍᏙᏗ ᏥᎩ.

source: But Israel, going after a law of righteousness, did not get it.
chr: ᎢᏏᎵᏍᎩᏂ ᎤᏂᏍᏓᏩᏛᏛ ᏗᎧᎿᏩᏛᏍᏗ ᎠᏚᏓᎴᏍᏙᏗ ᎨᏒᎢ, ᎾᏍᎩ ᎥᏝ ᏳᏂᏩᏛᎲ ᏗᎧᎿᏩᏛᏍᏗ ᎠᏚᏓᎴᏍᏙᏗ ᎨᏒᎢ.

source: Why? Because they were not searching for it by faith, but by works. They came up against the stone which was in the way;
chr: ᎦᏙᏃ? ᏅᏗᎦᎵᏍᏙᏗᎭ ᎾᏍᎩ ᎪᎯᏳᏗ ᎨᏒ ᏄᏅᏔᏅᎾ ᎨᏒᎢ, ᏗᎧᎿᏩᏛᏍᏗᏍᎩᏂ ᏂᎦᏪᏍᎬ ᎢᏯᏛᏁᏗ ᎨᏒ ᎤᏅᏔᏅᎢ; ᏚᏃᏕᏍᏔᏁᏰᏃ ᎾᏍᎩ Ꮎ ᏅᏯ ᏗᏓᏙᏕᎯᎯ ᎨᏒᎢ;

source: As it is said, See, I am putting in Zion a stone causing a fall, and a rock in the way: but he who has faith in him will not be put to shame.
chr: ᎾᏍᎩᏯ ᎯᎠ ᏥᏂᎬᏅ ᏥᎦᏪᎳ, ᎬᏂᏳᏉ ᏌᏯᏂ ᏓᏥᏂ ᏅᏯ ᏗᏓᏙᏕᎯᎯ, ᎠᎴ ᏅᏯ ᎠᏓᎿᏍᏆᎶᏍᏗᏍᎩ; ᎠᎴ ᎩᎶ ᎪᎯᏳᎲᏍᎨᏍᏗ ᎾᏍᎩ ᎥᏝ ᎤᏕᎰᎯᏍᏗ ᏱᎨᏎᏍᏗ.

source: Brothers, my heart's desire and my prayer to God for them is, that they may get salvation.
chr: ᎢᏓᎵᏅᏟ, ᎠᎩᎾᏫᏱ ᎢᏴᏛ ᎠᏆᏚᎵᎭ, ᎠᎴ ᏥᏯᏓᏙᎵᏍᏓᏁᎭ ᎤᏁᎳᏅᎯ ᎢᏏᎵ ᎤᎬᏩᎵ, ᎾᏍᎩ ᎨᏥᏍᏕᎸᏗᏱ.

source: For I give witness of them that they have a strong desire for God, but not with knowledge.
chr: ᎦᏥᏲᎢᏳᏓᏁᎯᏰᏃ ᎾᏍᎩ ᎤᏣᏘ ᎤᎾᏚᎵᏍᎬ ᎤᏁᎳᏅᎯ ᎪᎱᏍᏗ ᎤᎾᏛᏁᏗᏱ; ᎠᏎᏃ ᎥᏝ ᎠᎦᏙᎮᎯᏍᏗ ᎨᏒ ᏯᏅᏗᎭ.

source: Because, not having knowledge of God's righteousness, and desiring to give effect to their righteousness, they have not put themselves under the righteousness of God.
chr: ᎾᏂᎦᏔᎲᎾᏰᏃ ᎨᏒ ᏄᏍᏛ ᎤᏁᎳᏅᎯ ᎤᏓᏚᏓᎴᏍᏙᏗ ᎨᏒᎢ, ᎠᎴ ᎠᎾᏟᏂᎬᏁᎲ ᎤᏂᏍᏓᏱᏗᏍᏗᏱ ᎤᏅᏒ ᎤᎾᏤᎵ ᎤᎾᏚᏓᎴᏍᏙᏗ ᎨᏒᎢ, ᎥᏝ ᏧᎾᏓᏲᎯᏎᎸᎯ ᏱᎩ ᎤᏁᎳᏅᎯ ᎤᏓᏚᏓᎴᏍᏙᏗ ᎨᏒᎢ.

source: For Christ is the end of the law for righteousness to everyone who has faith.
chr: ᏗᎧᎿᏩᏛᏍᏗᏰᏃ ᎤᎬᏩᎴ ᎦᎶᏁᏛ ᎤᎾᏚᏓᎴᏍᏙᏗᏱ ᎾᏂᎥ ᎠᏃᎯᏳᎲᏍᎩ.

source: For Moses says that the man who does the righteousness which is of the law will get life by it.
chr: ᎼᏏᏰᏃ ᎧᏃᎮᎭ ᏄᏍᏛ ᎤᏓᏚᏓᎴᏍᏙᏗ ᎨᏒ ᏗᎧᎿᏩᏛᏍᏗ, ᎯᎠ ᏥᏂᎦᏪᎭ, ᎩᎶ ᏴᏫ ᎾᏍᎩ ᎾᏛᏁᎮᏍᏗ ᎬᏂᏛ ᎠᏩᏛᏗᏍᎨᏍᏗ.

source: But the righteousness which is of faith says these words, Say not in your heart, Who will go up to heaven? (that is, to make Christ come down:)
chr: ᎪᎯᏳᏗᏍᎩᏂ ᎠᏚᏓᎴᏍᏙᏗ ᎨᏒ ᎯᎠ ᏂᎦᏪᎭ, ᏞᏍᏗ ᏣᎾᏫᏱ ᎯᎠ ᏱᏂᏪᏍᎨᏍᏗ, ᎦᎪ ᎦᎸᎶᎢ ᏓᏰᏏ? (ᎾᏍᎩ ᎦᎶᏁᏛ ᎠᎦᏠᎥᏙᏗᏱ;)

source: Or, Who will go down into the deep? (that is, to make Christ come again from the dead:)
chr: ᎠᎴ ᎦᎪ ᎠᏍᏛᎩ ᎨᏒ ᏮᏓᎦᎶᏏ? (ᎾᏍᎩ ᎦᎶᏁᏛ ᎤᏲᎱᏒ ᏧᎴᏙᏗᏱ;)

source: But what does it say? The word is near you, in your mouth and in your heart: that is, the word of faith of which we are the preachers:
chr: ᎠᏎᏃ ᎦᏙ ᎠᏗᎭ? ᎧᏃᎮᏛ ᎮᎲ ᎾᎥᏂᏳ ᏄᏍᏗᏕᎦ, ᎾᏍᎩ ᎯᎰᎵᏉ, ᎠᎴ ᏣᎾᏫᏱᏉ ᎡᎭ; ᎾᏍᎩ ᎯᎠ ᎧᏃᎮᏛ ᎪᎯᏳᏗ ᎨᏒ ᎧᏃᎮᏍᎩ, ᎾᏍᎩ ᎠᏴ ᏦᏣᎵᏥᏙᎲᏍᎦ;

source: Because, if you say with your mouth that Jesus is Lord, and have faith in your heart that God has made him come back from the dead, you will have salvation:
chr: ᎾᏍᎩ ᎢᏳᏃ ᎯᎰᎵ ᏱᏨᏔᏅ ᎬᏂᎨᏒ ᏱᏂᏴᏁᎸ ᎤᎬᏫᏳᎯ ᏥᏌ, ᎠᎴ ᏣᎾᏫᏱ ᎢᏴᏛ ᏱᏦᎯᏳᏅ ᎤᏁᎳᏅᎯ ᏕᎤᎴᏔᏅ ᎤᏲᎱᏒᎢ, ᎠᏎ ᎡᏣᏍᏕᎸᏗ ᎨᏎᏍᏗ.

source: For with the heart man has faith to get righteousness, and with the mouth he says that Jesus is Lord to get salvation.
chr: ᎣᎾᏫᏰᏃ ᎬᏗ ᎠᎪᎯᏳᎲᏍᎪ ᎣᏚᏓᎴᏍᏗ ᏂᎦᎵᏍᏔᏂᎦ; ᎠᎴ ᎥᎰᎵ ᎬᏗ ᎬᏂᎨᏒ ᎾᎬᏁᎰ ᎥᏓᏗᏍᏕᎸᏗ ᏂᎦᎵᏍᏔᏂᎦ.

source: Because it is said in the holy Writings, Whoever has faith in him will not be shamed.
chr: ᎪᏪᎵᏰᏃ ᎯᎠ ᏂᎦᏪᎭ, ᎩᎶ ᎾᏍᎩ ᎪᎯᏳᎲᏍᎨᏍᏗ ᎥᏝ ᎤᏕᎰᎯᏍᏗ ᏱᎨᏎᏍᏗ.

source: And the Jew is not different from the Greek: for there is the same Lord of all, who is good to all who have hope in his name:
chr: ᎥᏝᏰᏃ ᏱᏚᎾᏓᎴᎾᎠ ᎠᏂᏧᏏ ᎠᏃ ᎠᏂᎪᎢ; ᎾᏍᎩᏉᏰᏃ ᎤᎬᏫᏳᎯ ᎾᏂᎥ ᎤᎾᏤᎵᎦ ᎤᏣᏘ ᎤᏪᎿᎢᏳ ᏧᏍᏕᎸᏗᏱ ᎾᏂᎥ ᎬᏩᏓᏙᎵᏍᏓᏁᎯ.

source: Because, Whoever will give worship to the name of the Lord will get salvation.
chr: ᎾᏂᎥᏉᏰᏃ ᎩᎶ ᎠᎾᏓᏙᎵᏍᏗᏍᎨᏍᏗ ᏚᏙᎥ ᎤᎬᏫᏳᎯ ᎠᏂᏁᎢᏍᏗᏍᎨᏍᏗ ᎨᏥᏍᏕᎸᏗ ᎨᏎᏍᏗ.

source: But how will they give worship to him in whom they have no faith? and how will they have faith in him of whom they have not had news? and how will they have news without a preacher?
chr: ᎦᏙᏃ ᏱᎦᎵᏍᏙᏓ ᏯᎾᏓᏙᎵᏍᏓᏏ ᎩᎶ ᏄᏃᎯᏳᏒᎾ ᏱᎩ ᎡᎲᎢ? ᎠᎴ ᎦᏙ ᏱᎦᎵᏍᏙᏓ ᏯᏃᎯᏳᎲᎦ ᎩᎶ ᎡᎲ ᎾᏍᎩ ᎤᎾᏛᎦᏅᎯ ᏂᎨᏒᎾ ᏱᎩ ᎡᎲᎢ? ᎠᎴ ᎦᏙ ᏱᎦᎵᏍᏙᏓ ᏯᎾᏛᎬᎦ ᎩᎶ ᎠᎵᏥᏙᎲᏍᎩ ᏄᏁᎲᎾ ᏱᎩ?

source: And how will there be preachers if they are not sent? As it is said, How beautiful are the feet of those who give the glad news of good things.
chr: ᎠᎴ ᎦᏙ ᏱᎦᎵᏍᏙᏓ ᏯᎾᎵᏥᏙᎲᎦ ᎢᏳᏃ ᏂᎨᏥᏅᏒᎾ ᏱᎩ? ᎾᏍᎩᏯ ᎯᎠ ᏥᏂᎬᏅ ᏥᎪᏪᎳ, ᏂᏚᏬᏚᎭ ᏧᎾᎳᏏᏕᏂ ᎾᏍᎩ Ꮎ ᎣᏍᏛ ᎧᏃᎮᏛ ᏅᏩᏙᎯᏯᏛ ᎠᏓᏁᎯ ᎠᎾᎵᏥᏙᎲᏍᎩ, ᎣᏍᏛ ᎧᏃᎮᏛ ᎠᎾᎵᏥᏙᎲᏍᎩ ᎾᏍᎩ ᎣᏍᏛ ᎤᎬᏩᎵ ᎨᏒᎢ.

source: But they have not all given ear to the good news. For Isaiah says, Lord, who has had faith in our word?
chr: ᎠᏎᏃ ᎥᏝ ᎾᏂᎥ ᎤᏃᎯᏳᏅᎯ ᏱᎩ ᎣᏍᏛ ᎧᏃᎮᏛ. ᎢᏌᏯᏰᏃ ᎯᎠ ᏂᎦᏪᎭ, ᏱᎰᏩ, ᎦᎪ ᎤᏬᎯᏳᏅ ᎣᏥᏃᎮᏍᎬᎢ?

source: So faith comes by hearing, and hearing by the word of Christ.
chr: ᎾᏍᎩᏃ ᎯᎠ ᏥᏄᏍᏗ ᎪᎯᏳᏗ ᎨᏒ ᎠᏛᎪᏗᏱ ᏗᏓᎴᎲᏍᎦ, ᎠᏛᎪᏗᏱᏃ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᎧᏃᎮᏛ ᏗᏓᎴᎲᏍᎦ.

source: But I say, Did not the word come to their ears? Yes, certainly: Their sound has gone out into all the earth, and their words to the ends of the world.
chr: ᎠᏎᏃ ᎠᏴ ᎯᎠ ᏂᏥᏪᎭ, ᏝᏍᎪ ᏳᎾᏛᎦᏅ? ᎥᎥ, ᎤᏙᎯᏳᎯ, ᎤᎾᏓᏃᏴᎵᏍᏛ ᏚᏰᎵᏒ ᎡᎳᏂᎬᎢ, ᎠᎴ ᎠᏂᏬᏂᏍᎬ ᎡᎶᎯ ᏩᏍᏛ ᎢᏴᏛ ᏚᏰᎵᏒ.

source: But I say, Had Israel no knowledge? First Moses says, You will be moved to envy by that which is not a nation, and by a foolish people I will make you angry.
chr: ᎠᏎᏃ ᎠᏴ ᏂᏥᏪᎭ, ᏝᏍᎪ ᏯᏂᎦᏔᎮ ᎢᏏᎵ? ᎢᎬᏱ ᎨᏒ ᎼᏏ ᎯᎠ ᏂᎦᏪᎭ, ᎢᏣᏛᏳᎨᏗᏱ ᏅᏓᏨᏴᏁᎵ ᏓᎦᏥᏴᏔᏂ ᎾᏍᎩ Ꮎ ᎠᏰᎵ ᎤᏃᏢᎯ ᏂᎨᏒᎾ ᎨᏒᎢ, ᎠᎴ ᏄᎾᏓᏅᏛᎾ ᏴᏫ ᎦᏥᏴᏗᏍᎬ ᏓᏨᎾᎸᏍᏔᏂ.

source: And Isaiah says without fear, Those who were not searching for me made discovery of me; and I was seen by those whose hearts were turned away from me.
chr: ᎠᏎᏃ ᎢᏌᏯ ᏂᎦᎾᏰᏍᎬᎾ ᎯᎠ ᏂᎦᏪᎭ, ᎬᎩᏩᏛᎲᎩ ᎾᏍᎩ Ꮎ ᏂᎬᎩᏲᎸᎾ ᎨᏒᎢ; ᎬᏂᎨᏒ ᏂᎬᏋᏁᎸᎩ ᎠᏁᎲ ᎾᏍᎩ Ꮎ ᎾᎾᏛᏛᎲᏍᎬᎾ ᎨᏒ ᎨᎥᎢ.

source: But about Israel he says; All the day my hands have been stretched out to a people whose hearts were turned away, and who put themselves against my word.
chr: ᎢᏏᎵᏍᎩᏂ ᎯᎠ ᏂᏕᎦᏪᏎᎭ, ᎤᏙᏓᏆᏛ ᏓᏆᏎᎵᏛᎩ ᎦᏥᏯᏂᏍᎬ ᏄᏃᎯᏳᏒᎾ ᎠᎴ ᎤᏂᎪᏁᎶᎯᏌᏘ ᏴᏫ.

source: So I say, Has God put his people on one side? Let there be no such thought. For I am of Israel, of the seed of Abraham, of the tribe of Benjamin.
chr: ᎾᏍᎩᏃ ᎯᎠ ᏂᏥᏪᎭ, ᏥᎪ ᎤᏁᎳᏅᎯ ᎢᏴᏛ ᏂᏚᏩᏁᎸ ᏧᏤᎵ ᏴᏫ? ᎬᏩᏟᏍᏗ. ᎠᏴᏰᏃ ᎾᏍᏉ ᏥᎢᏏᎵ, ᎡᏆᎭᎻ ᎤᏁᏢᏔᏅᏛ ᏅᏛᏆᏓᎴᏅᎯ, ᏇᏂ ᎠᏂᎳᏍᏓᎸ ᎨᎳ.

source: God has not put away the people of his selection. Or have you no knowledge of what is said about Elijah in the holy Writings? how he says words to God against Israel,
chr: ᎤᏁᎳᏅᎯ ᎥᏝ ᎢᏴᏛ ᏱᏂᏚᏩᏁᎸ ᏧᏤᎵ ᏴᏫ ᎾᏍᎩ ᎦᏳᎳ ᏥᏂᏓᎦᏔᎰᎢ. ᏝᏍᎪ ᏱᏥᎦᏔᎭ ᏂᎦᏪᏍᎬ ᎪᏪᎵ ᎾᎿ ᎢᎳᏯ ᎠᏥᏃᎮᏍᎬᎢ? ᎾᏍᎩ ᎠᏔᏲᎯᎲ ᏕᎠᏡᏗᏍᎬ ᎢᏏᎵ ᎯᎠ ᏂᎦᏪᏍᎬᎢ,

source: Lord, they have put your prophets to death, and made waste your altars, and now I am the last, and they are searching for me to take away my life.
chr: ᏱᎰᏩ, ᏕᏅᏂᎸ ᏗᏣᏤᎵ ᎠᎾᏙᎴᎰᏍᎩ, ᎠᎴ ᎠᏥᎸ ᏗᎨᎳᏍᏗᏱ ᏗᏣᏤᎵ ᏚᏂᏲᏍᏔᏅ; ᎠᎴ ᎠᏋᏒᎯᏳ ᎠᏆᎵᏃᎯᏴ, ᎠᎴ ᎠᏴ ᎬᎩᎯᏍᏗᏱ ᎤᏂᏲᎭ.

source: But what answer does God make to him? I have still seven thousand men whose knees have not been bent to Baal.
chr: ᎠᏎᏃ ᎦᏙ ᎠᏗᎭ ᎤᏁᎳᏅᎯ ᎤᏬᎯᎵᏴᏍᏓᏁᎲᎢ? ᎬᏆᎵᏃᎯᏰᏗᏱ ᎾᏋᏁᎸ ᎦᎵᏉᎩ ᎢᏯᎦᏴᎵ ᎢᏯᏂᏛ ᎠᏂᏍᎦᏯ ᎾᏍᎩ ᏂᏚᎾᎵᏂᏆᏅᏁᎸᎾ ᏇᎠᎵ.

source: In the same way, there are at this present time some who are marked out by the selection of grace.
chr: ᎾᏍᎩᏯᏃ ᎾᏍᏉ ᎪᎯ ᎨᏒᎢ ᎤᎾᎵᏃᎯᏴᎯ ᎠᏁᎭ ᎾᏍᎩᏯ ᎬᏩᎦᏘᏯ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᎤᏩᏔᏅ ᏚᏑᏰᏒᎢ.

source: But if it is of grace, then it is no longer of works: or grace would not be grace.
chr: ᎢᏳᏃ ᎬᏩᎦᏘᏯ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᎢᏳᏩᏂᏌᏅᎯ ᏱᎩ; ᎿᏉ ᎥᏝ ᏗᎦᎸᏫᏍᏓᏁᏗ ᎨᏒ ᎢᏳᏩᏂᏌᏅᎯ ᏱᎩ; ᎢᏳᏃ ᎾᏍᎩ ᏱᏄᏍᏗ, ᎬᏩᎦᏘᏯ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᎥᏝ ᎿᏉ ᎬᏩᎦᏘᏯ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᏱᎦᎩ. ᎢᏳᏍᎩᏂ ᏗᎦᎸᏫᏍᏓᏁᏗ ᎨᏒ ᎢᏳᏩᏂᏌᏅᎯ ᏱᎩ, ᎿᏉ ᎥᏝ ᎬᏩᎦᏘᏯ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᎢᏳᏩᏂᏌᏅᎯ ᏱᎩ; ᎢᏳᏃ ᎾᏍᎩ ᏱᏄᏍᏗ, ᏗᎦᎸᏫᏍᏓᏁᏗ ᎨᏒ ᎥᏝ ᎿᏉ ᏗᎦᎸᏫᏍᏓᏁᏗ ᎨᏒ ᏱᎦᎩ.

source: What then? That which Israel was searching for he did not get, but those of the selection got it and the rest were made hard.
chr: ᎦᏙᏃ [ᏫᎬᏛᏗ ᏂᎦᎵᏍᏗᎭ?] ᎢᏏᎵ ᎥᏝ ᏳᏩᏛᎲ ᎾᏍᎩ ᏧᏲᎲᎩ; ᎨᎦᏑᏰᏛᏍᎩᏂ ᎨᏒ ᎤᏂᏩᏛᎲ, ᎠᏂᏐᎢᏃ ᏚᏂᎫᏏᏲᏨᎩ.

source: As it was said in the holy Writings, God gave them a spirit of sleep, eyes which might not see, and ears which have no hearing, to this day.
chr: ᎾᏍᎩᏯ ᎯᎠ ᏥᏂᎬᏅ ᏥᎪᏪᎳ, ᎤᏁᎳᏅᎯ ᏚᏁᎸ ᎠᏓᎵᏔᏗᏍᎩ ᎠᏓᏅᏙ, ᎠᎴ ᏗᏂᎦᏙᎵ ᏗᎬᏩᏂᎪᏩᏛᏙᏗ ᏂᎨᏒᎾ, ᎠᎴ ᏗᏂᎴᏂ ᏗᎬᏩᎾᏛᎪᏙᏗ ᏂᎨᏒᎾ, ᎪᎯ ᎨᏒ ᎢᏯᏍᏗ.

source: And David says, Let their table be made a net for taking them, and a stone in their way, and a punishment:
chr: ᎠᎴ ᏕᏫ ᎯᎠ ᏂᎦᏪᎭ, ᎠᎵᏍᏓᏴᏗᏱ ᎤᏂᏍᎩᎸ ᎤᏁᏍᎩ, ᎠᎴ ᎤᏂᏌᏛᎥᏍᎩ, ᎠᎴ ᏧᏃᏕᎯᎯ, ᎠᎴ ᎤᏂᏍᏛᏗᏍᏙᏗ ᏫᏄᎾᎵᏍᏓᏏ;

source: Let their eyes be made dark so that they may not see, and let their back be bent down at all times.
chr: ᏗᏂᎦᏙᎵ ᏫᏗᎨᎦᎵᏏᎲᏍᏓᏏ, ᎾᏍᎩ ᎤᏂᎪᏩᏛᏗᏱ ᏂᎨᏒᎾ, ᎠᎴ ᏂᎪᎯᎸ ᏚᎾᏗᏌᏓᏕᎨᏍᏗ.

source: So I say, Were their steps made hard in order that they might have a fall? In no way: but by their fall salvation has come to the Gentiles, so that they might be moved to envy.
chr: ᎯᎠ ᎠᏗᎾ ᏂᏥᏪᎭ, ᏥᎪ ᏚᏃᏕᎸ ᏰᎵ ᏧᏂᏅᎢᏍᏗᏱ ᎠᏰᎸᏎᎢ? ᎬᏩᏟᏍᏗ; ᎾᏍᎩᏍᎩᏂ ᏚᏂᏅᏨ ᏄᏩᏂᏌᏅ ᎠᎵᏍᏕᎸᏙᏗ ᎨᏒ ᎤᏂᎷᏤᎸ ᏧᎾᏓᎴᏅᏛ ᏴᏫ, ᎾᏍᎩ ᎤᎾᏛᏳᎨᏗᏱ ᎢᏳᏅᏂᏐᏗᏱ.

source: Now, if their fall is the wealth of the world, and their loss the wealth of the Gentiles, how much greater will be the glory when they are made full?
chr: ᎢᏳᏃ ᎾᏍᎩ ᏚᏂᏅᏨ ᎤᏁᏅᎢᏍᏗᏍᎩ ᏱᎩ ᎡᎶᎯ, ᎠᎴ ᎾᏍᎩ ᎡᏍᎦ ᏄᎾᎵᏍᏓᏁᎲ ᎤᏁᏅᎢᏍᏗᏍᎩ ᏱᎩ ᏧᎾᏓᎴᏅᏛ ᏴᏫ, ᏂᎦᎥ ᎤᎶᏒᏍᏕᏍᏗ ᎠᏂᎧᎵᏨᎭ.

source: But I say to you, Gentiles, in so far as I am the Apostle of the Gentiles, I make much of my position:
chr: ᏂᎯᏰᏃ ᎢᏨᏬᏁᏗᎭ ᏗᏣᏓᎴᏅᏛ ᏴᏫ, ᏅᏗᎦᎵᏍᏙᏗᎭ ᎠᏴ ᎥᎩᏅᏏᏛ ᎨᏒ ᏧᎾᏓᎴᏅᏛ ᏴᏫ ᎦᏥᏯᎵᏥᏙᏁᏗᏱ, ᏥᎸᏉᏗᎭ ᏄᏍᏛ ᎥᏆᏒᎦᎶᏛᎢ;

source: If in any way those who are of my flesh may be moved to envy, so that some of them may get salvation by me.
chr: ᎾᏍᎩ ᎢᏳᏃ ᏰᎵ ᎢᎬᏆᏛᏁᏗ ᏱᎩ, ᎾᏍᎩ ᎢᏯᏋᏂᏐᏗᏱ ᎤᎾᏟᏂᎬᏁᏗᏱ ᎣᎩᏠᏱ ᎨᏒᎢ, ᎠᎴ ᎾᏍᎩ ᎢᎦᏛ ᎦᏥᏍᏕᎸᏗᏱ.

source: For, if by their putting away, the rest of men have been made friends with God, what will their coming back again be, but life from the dead?
chr: ᎢᏳᏰᏃ ᎾᏍᎩ ᎨᏥᏐᏅᎢᏍᏔᏅᎢ ᎤᏃᎯᏍᏓᏁᎯ ᏱᏂᎦᎵᏍᏗ ᎡᎶᎯ, ᎦᏙ ᎤᎵᏍᏙᏗ ᎨᏎᏍᏗ ᏕᎨᎦᏓᏂᎸᏨᎭ, ᏚᏂᏲᎱᏒᏍᎩᏂ ᏚᎾᎴᎯᏌᏅ ᎨᏎᏍᏗ.

source: And if the first-fruit is holy, so is the mass: and if the root is holy, so are the branches.
chr: ᎢᏳᏰᏃ ᎢᎬᏱᏱ ᎤᎬᏛᎾᏨᎯ ᎦᎸᏉᏗᏳ ᏱᎩ, ᏂᎦᏛ ᎾᏍᏉ [ᎦᎸᏉᏗᏳ;] ᎢᏳ ᎠᎴ ᏚᎿᏍᏕᏢ ᎦᎸᏉᏗᏳ ᏱᎩ, ᎾᏍᎩᏯ ᎾᏍᏉ ᏚᏩᏂᎦᎸᎢ.

source: But if some of the branches were broken off, and you, an olive-tree of the fields, were put in among them, and were given a part with them in the root by which the olive-tree is made fertile,
chr: ᎢᏳᏃ ᏚᏩᏂᎦᎸ ᎢᎦᏛ ᏱᏗᎬᏂᎦᎴᏒ, ᏂᎯᏃ ᎢᎾᎨ-ᎮᎯ ᎣᎵᏩ ᏡᎬ ᎾᎿ ᏱᏫᏰᏣᏱᏢᏔᏅ, ᎠᎴ ᎾᏍᎩᏯ ᎤᎾᎵᏍᏕᎶᏛ ᏱᏤᎳᏗᏍᏗ ᏱᏣᎵᏍᏕᎸᏗ ᏚᎿᏍᏕᏢ ᎠᎴ ᎦᎵᏦᏅ ᎣᎵᏩ ᏡᎬᎢ;

source: Do not be uplifted in pride over the branches: because it is not you who are the support of the root, but it is by the root that you are supported.
chr: ᏞᏍᏗ ᏱᏔᏢᏈᏎᎮᏍᏗ ᏚᏩᏂᎦᎸᎢ. ᎢᏳᏍᎩᏂ ᏯᏢᏈᏍᎦ, ᎥᏝ ᏂᎯ ᏚᎿᏍᏕᏢ ᏱᏘᎾᏄᎪᏫᏍᎦ, ᏚᎿᏍᏕᏢᏍᎩᏂ ᏂᎯ ᎨᏣᎾᏄᎪᏫᏍᎦ.

source: You will say, Branches were broken off so that I might be put in.
chr: ᎯᎠ ᎠᏗᎾ ᎨᎵ ᏅᏛᎯᏪᏏ, ᏚᏩᏂᎦᎸ ᏚᏅᏂᎦᎸᎲᎩ, ᎾᏍᎩ ᎠᏴ ᎥᏋᏱᏢᏗᏱ ᎾᎿᏂ.

source: Truly, because they had no faith they were broken off, and you have your place by reason of your faith. Do not be lifted up in pride, but have fear;
chr: ᎤᏙᎯᏳᎯ; ᏄᏃᎯᏳᏒᎾ ᎨᏒ ᏅᏓᏳᎵᏍᏙᏔᏅᎩ ᏕᎨᏥᏂᎦᎸᎲᎩ; ᎠᎴ ᏂᎯ ᏥᏙᎦ ᏦᎯᏳᏒ ᏂᎬᏂᏏᎭ. ᏞᏍᏗᏉ ᎤᏟ ᏱᏣᏤᎸᏎᏍᏗ, ᎯᎾᏰᏍᎨᏍᏗᏍᎩᏂ;

source: For, if God did not have mercy on the natural branches, he will not have mercy on you.
chr: ᎢᏳᏰᏃ ᎤᏁᎳᏅᎯ ᏂᏚᎨᏳᏅᎾ ᏱᎩ ᏅᏁᎯᏯ ᏚᏩᏂᎦᎸᎢ, ᏂᎯ ᎾᏍᏉ ᏂᏣᎨᏳᏅᎾᏉ ᏱᎩ.

source: See then that God is good but his rules are fixed: to those who were put away he was hard, but to you he has been good, on the condition that you keep in his mercy; if not, you will be cut off as they were.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎭᎦᏌᏯᏍᏓ ᎤᏓᏅᏖᏳ ᎨᏒ ᎠᎴ ᎠᏍᏓᏱᏳ ᎨᏒ ᎤᏁᎳᏅᎯ; ᎠᏍᏓᏱᏳ ᏂᏕᎬᏁᎲ ᎾᏍᎩ Ꮎ ᏧᏂᏅᏨᎯ; ᏂᎯᏍᎩᏂ ᎤᏓᏅᏘᏳ ᎨᏒ ᏣᎾᏄᎪᏫᏎᎲᎢ; ᎢᏳᏃ ᏱᏅᏩᏍᏗᏗ ᏕᏣᏂᏴᏒ ᎤᏓᏅᏘᏳ ᎨᏒᎢ; ᎥᏝᏰᏃ ᎾᏍᎩ ᏂᎯ ᎾᏍᏉ ᎡᏨᎾᎦᎴᏍᏗ ᎨᏎᏍᏗ.

source: And they, if they do not go on without faith, will be united to the tree again, because God is able to put them in again.
chr: ᎠᎴ ᎾᏍᎩ Ꮎ ᎾᏍᏉ, ᎢᏳᏃ ᎢᎬᏩᏍᏗᎭᏉ ᏂᎨᏒᎾ ᎢᎨᏎᏍᏗ ᏄᏃᎯᏳᏒᎾ ᎨᏒᎢ, ᎨᏥᏱᏢᏗ ᎨᏎᏍᏗ; ᎤᏁᎳᏅᎯᏰᏃ ᏰᎵᏉ ᏔᎵᏁ ᏗᎬᏩᏱᏢᏗ.

source: For if you were cut out of a field olive-tree, and against the natural use were united to a good olive-tree, how much more will these, the natural branches, be united again with the olive-tree which was theirs?
chr: ᎢᏳᏰᏃ ᏂᎯ ᎢᎾᎨ ᎡᎯᏯ ᎣᎵᏩ ᏡᎬ ᏨᏱᏢᏅᎯ ᏱᎩ, ᎠᎴ ᎾᎿ ᎮᎯᏯ ᏂᎨᏒᎾ ᎨᏒ ᎣᏍᏛ ᎣᎵᏩ ᏡᎬ ᏰᏨᏱᏢᏅ, ᎤᏟᎯᏳᏍᎩᏂ ᎠᎯᏘᏳ ᎾᏍᎩ Ꮎ ᎾᎿ ᎠᏁᎯᏯ ᏥᎩ, ᎨᏥᏱᏢᏗ ᎾᎿ ᎤᏅᏒ ᎤᎾᏤᎵᎦᏯ ᎣᎵᏩ ᏡᎬᎢ.

source: For it is my desire, brothers, that this secret may be clear to you, so that you may not have pride in your knowledge, that Israel has been made hard in part, till all the Gentiles have come in;
chr: ᎥᏝᏰᏃ ᏯᏆᏚᎵ, ᎢᏓᎵᏅᏟ, ᏂᏥᎦᏔᎲᎾᏉ ᎢᏳᎵᏍᏙᏗᏱ ᎯᎠ ᎾᏍᎩ ᎤᏕᎵᏛ ᎨᏒᎢ, (ᎢᏥᎦᏔᎾᎢᏉᏰᏃ ᏱᏅᏣᎵᏍᏓ ᎢᏨᏒ ᎢᏣᏓᏅᏖᏍᎬᎢ,) ᎾᏍᎩ ᎠᎫᏏᏲᎢᏍᏗ ᎨᏒ ᎤᏂᎷᏤᎸ ᎢᎦᏛ ᎢᏏᎵ, ᎬᏂ ᎤᏂᏣᏘ ᎨᏒ ᏧᎾᏓᎴᏅᏛ ᏴᏫ ᎤᏂᏴᎸᎯ ᎨᏎᏍᏗ,

source: And so all Israel will get salvation: as it is said in the holy Writings, There will come out of Zion the One who makes free; by him wrongdoing will be taken away from Jacob:
chr: ᎾᏍᎩᏃ ᏅᏓᎦᎵᏍᏔᏂ ᏂᎦᏗᏳ ᎢᏏᎵ ᎨᏥᏍᏕᎸᏗ ᎨᏎᏍᏗ; ᎾᏍᎩᏯ ᎯᎠ ᏥᏂᎬᏅ ᏥᎪᏪᎳ, ᏌᏯᏂ ᏅᏓᏳᏓᎴᏅᎯ ᏓᎦᎷᏥ ᏗᎫᏓᎴᏍᎩ, ᎠᎴ ᎢᏴᏛ ᏅᏓᎬᏁᎵ ᎤᏁᎳᏅᎯ ᏄᏂᎸᏉᏛᎾ ᎨᏒ ᎢᎦᏈ ᎤᏪᎲᎢ.

source: And this is my agreement with them, when I will take away their sins.
chr: ᎯᎠᏰᏃ ᎾᏍᎩ ᏄᏍᏗ ᎧᏃᎮᏛ ᏕᎦᏥᏯᏠᎢᏍᏓᏁᎸᎢ, ᎾᎯᏳ ᎦᏥᎥᎡᏗ ᏂᎦᎵᏍᏔᏅᎭ ᎤᏂᏍᎦᏅᏨᎢ.

source: As far as the good news is in question, they are cut off from God on account of you, but as far as the selection is in question, they are loved on account of the fathers.
chr: ᎣᏍᏛᏃ ᎧᏃᎮᏛ ᎤᎬᏩᎵ ᎨᏒᎢ, ᎨᏥᏍᎦᎩ ᏄᎾᎵᏍᏔᏅ ᏂᎯ ᎨᏒ ᏅᏗᎦᎵᏍᏙᏗᎭ; ᏓᏑᏰᏍᎬᏍᎩᏂ ᎤᎬᏩᎵ, ᎨᏥᎨᏳᎭ ᎠᏂᎦᏴᎵᎨ ᎨᏒ ᏅᏗᎦᎵᏍᏙᏗᎭ.

source: Because God's selection and his mercies may not be changed.
chr: ᎤᏁᎳᏅᎯᏰᏃ ᎤᏓᏁᏗ ᎨᏒ ᎠᎴ ᎤᏓᏯᏅᏗ ᎨᏒ ᏝᏉ ᎤᏰᎸᏗ ᏂᎨᏒᎾ ᎨᏐᎢ.

source: For as you, in time past, were not under the rule of God, but now have got mercy through their turning away,
chr: ᏂᎯᏰᏃ ᏧᏩᎫᏔᏅᏒ ᏁᏦᎢᏳᏒᎾ ᏥᎨᏒᎩ ᎤᏁᎳᏅᎯ, ᎠᏎᏃ ᎪᎯ ᎡᏥᏙᎵᏨᎯ ᎢᎩ ᏅᏗᎦᎵᏍᏙᏗᎭ ᎾᏍᎩ ᏄᏃᎯᏳᏒᎾ ᎨᏒᎢ;

source: So in the same way these have gone against the orders of God, so that by the mercy given to you they may now get mercy.
chr: ᎾᏍᎩᏯ ᎾᏍᏉ ᎾᏍᎩ ᎯᎠ ᎪᎯ ᎨᏒ ᎥᏝ ᏳᏃᎯᏳᏅ, ᎾᏍᎩ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᎢᏣᏤᎵ ᎢᏳᏩᏂᏐᏗᏱ ᎾᏍᎩ ᎾᏍᏉ ᎨᏥᏙᎵᏍᏗ ᎢᏳᎵᏍᏙᏗᏱ.

source: For God has let them all go against his orders, so that he might have mercy on them all.
chr: ᎤᏁᎳᏅᎯᏰᏃ ᏚᏭᎪᏔᏅ ᏂᎦᏗᏳ ᏄᏃᎯᏳᏒᎾ ᎨᏒᎢ, ᎾᏍᎩ ᏂᎦᏗᏳ ᏧᏪᏙᎵᏍᏗ ᎢᏳᎵᏍᏙᏗᏱ.
